espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_system_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LP_SYSTEM_REG_LP_SYS_VER_DATE_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SYS_VER_DATE_REG (DR_REG_LP_SYS_BASE + 0x0)
/** LP_SYSTEM_REG_VER_DATE : R/W; bitpos: [31:0]; default: 539165961;
 *  need_des
 */
#define LP_SYSTEM_REG_VER_DATE    0xFFFFFFFFU
#define LP_SYSTEM_REG_VER_DATE_M  (LP_SYSTEM_REG_VER_DATE_V << LP_SYSTEM_REG_VER_DATE_S)
#define LP_SYSTEM_REG_VER_DATE_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_VER_DATE_S  0

/** LP_SYSTEM_REG_CLK_SEL_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_CLK_SEL_CTRL_REG (DR_REG_LP_SYS_BASE + 0x4)
/** LP_SYSTEM_REG_ENA_SW_SEL_SYS_CLK : R/W; bitpos: [16]; default: 0;
 *  reserved
 */
#define LP_SYSTEM_REG_ENA_SW_SEL_SYS_CLK    (BIT(16))
#define LP_SYSTEM_REG_ENA_SW_SEL_SYS_CLK_M  (LP_SYSTEM_REG_ENA_SW_SEL_SYS_CLK_V << LP_SYSTEM_REG_ENA_SW_SEL_SYS_CLK_S)
#define LP_SYSTEM_REG_ENA_SW_SEL_SYS_CLK_V  0x00000001U
#define LP_SYSTEM_REG_ENA_SW_SEL_SYS_CLK_S  16
/** LP_SYSTEM_REG_SW_SYS_CLK_SRC_SEL : R/W; bitpos: [17]; default: 0;
 *  reserved
 */
#define LP_SYSTEM_REG_SW_SYS_CLK_SRC_SEL    (BIT(17))
#define LP_SYSTEM_REG_SW_SYS_CLK_SRC_SEL_M  (LP_SYSTEM_REG_SW_SYS_CLK_SRC_SEL_V << LP_SYSTEM_REG_SW_SYS_CLK_SRC_SEL_S)
#define LP_SYSTEM_REG_SW_SYS_CLK_SRC_SEL_V  0x00000001U
#define LP_SYSTEM_REG_SW_SYS_CLK_SRC_SEL_S  17

/** LP_SYSTEM_REG_SYS_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_SYS_CTRL_REG (DR_REG_LP_SYS_BASE + 0x8)
/** LP_SYSTEM_REG_LP_CORE_DISABLE : R/W; bitpos: [0]; default: 0;
 *  lp cpu disable
 */
#define LP_SYSTEM_REG_LP_CORE_DISABLE    (BIT(0))
#define LP_SYSTEM_REG_LP_CORE_DISABLE_M  (LP_SYSTEM_REG_LP_CORE_DISABLE_V << LP_SYSTEM_REG_LP_CORE_DISABLE_S)
#define LP_SYSTEM_REG_LP_CORE_DISABLE_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_DISABLE_S  0
/** LP_SYSTEM_REG_SYS_SW_RST : WT; bitpos: [1]; default: 0;
 *  digital system software reset bit
 */
#define LP_SYSTEM_REG_SYS_SW_RST    (BIT(1))
#define LP_SYSTEM_REG_SYS_SW_RST_M  (LP_SYSTEM_REG_SYS_SW_RST_V << LP_SYSTEM_REG_SYS_SW_RST_S)
#define LP_SYSTEM_REG_SYS_SW_RST_V  0x00000001U
#define LP_SYSTEM_REG_SYS_SW_RST_S  1
/** LP_SYSTEM_REG_FORCE_DOWNLOAD_BOOT : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_FORCE_DOWNLOAD_BOOT    (BIT(2))
#define LP_SYSTEM_REG_FORCE_DOWNLOAD_BOOT_M  (LP_SYSTEM_REG_FORCE_DOWNLOAD_BOOT_V << LP_SYSTEM_REG_FORCE_DOWNLOAD_BOOT_S)
#define LP_SYSTEM_REG_FORCE_DOWNLOAD_BOOT_V  0x00000001U
#define LP_SYSTEM_REG_FORCE_DOWNLOAD_BOOT_S  2
/** LP_SYSTEM_REG_DIG_FIB : R/W; bitpos: [10:3]; default: 255;
 *  need_des
 */
#define LP_SYSTEM_REG_DIG_FIB    0x000000FFU
#define LP_SYSTEM_REG_DIG_FIB_M  (LP_SYSTEM_REG_DIG_FIB_V << LP_SYSTEM_REG_DIG_FIB_S)
#define LP_SYSTEM_REG_DIG_FIB_V  0x000000FFU
#define LP_SYSTEM_REG_DIG_FIB_S  3
/** LP_SYSTEM_REG_IO_MUX_RESET_DISABLE : R/W; bitpos: [11]; default: 0;
 *  reset disable bit for LP IOMUX
 */
#define LP_SYSTEM_REG_IO_MUX_RESET_DISABLE    (BIT(11))
#define LP_SYSTEM_REG_IO_MUX_RESET_DISABLE_M  (LP_SYSTEM_REG_IO_MUX_RESET_DISABLE_V << LP_SYSTEM_REG_IO_MUX_RESET_DISABLE_S)
#define LP_SYSTEM_REG_IO_MUX_RESET_DISABLE_V  0x00000001U
#define LP_SYSTEM_REG_IO_MUX_RESET_DISABLE_S  11
/** LP_SYSTEM_REG_ANA_FIB : RO; bitpos: [20:14]; default: 127;
 *  need_des
 */
#define LP_SYSTEM_REG_ANA_FIB    0x0000007FU
#define LP_SYSTEM_REG_ANA_FIB_M  (LP_SYSTEM_REG_ANA_FIB_V << LP_SYSTEM_REG_ANA_FIB_S)
#define LP_SYSTEM_REG_ANA_FIB_V  0x0000007FU
#define LP_SYSTEM_REG_ANA_FIB_S  14
/** LP_SYSTEM_REG_LP_FIB_SEL : R/W; bitpos: [28:21]; default: 255;
 *  This is for compatibility with hw_ver3 chips
 *  This field does not exist on hw_ver1 chips
 */
#define LP_SYSTEM_REG_LP_FIB_SEL    0x000000FFU
#define LP_SYSTEM_REG_LP_FIB_SEL_M  (LP_SYSTEM_REG_LP_FIB_SEL_V << LP_SYSTEM_REG_LP_FIB_SEL_S)
#define LP_SYSTEM_REG_LP_FIB_SEL_V  0x000000FFU
#define LP_SYSTEM_REG_LP_FIB_SEL_S  21
/** LP_SYSTEM_REG_LP_FIB_BOD_RESET : R/W; bitpos: [22]; default: 1;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_FIB_BOD_RST    BIT(22)
#define LP_SYSTEM_REG_LP_FIB_BOD_RST_M  (LP_SYSTEM_REG_LP_FIB_BOD_RST_V << LP_SYSTEM_REG_LP_FIB_BOD_RST_S)
#define LP_SYSTEM_REG_LP_FIB_BOD_RST_V  0x00000001U
#define LP_SYSTEM_REG_LP_FIB_BOD_RST_S  22
/** LP_SYSTEM_REG_LP_FIB_SUPER_WDT_RST : R/W; bitpos: [23]; default: 1;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_FIB_SUPER_WDT_RST     BIT(23)
#define LP_SYSTEM_REG_LP_FIB_SUPER_WDT_RST_M  (LP_SYSTEM_REG_LP_FIB_SUPER_WDT_RST_V << LP_SYSTEM_REG_LP_FIB_SUPER_WDT_RST_S)
#define LP_SYSTEM_REG_LP_FIB_SUPER_WDT_RST_V  0x00000001U
#define LP_SYSTEM_REG_LP_FIB_SUPER_WDT_RST_S  23
/** LP_SYSTEM_REG_LP_FIB_DCDC_SWITCH : R/W; bitpos: [25]; default: 1;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_FIB_DCDC_SWITCH    BIT(25)
#define LP_SYSTEM_REG_LP_FIB_DCDC_SWITCH_M  (LP_SYSTEM_REG_LP_FIB_DCDC_SWITCH_V << LP_SYSTEM_REG_LP_FIB_DCDC_SWITCH_S)
#define LP_SYSTEM_REG_LP_FIB_DCDC_SWITCH_V  0x00000001U
#define LP_SYSTEM_REG_LP_FIB_DCDC_SWITCH_S  25

/** LP_SYSTEM_REG_LP_FIB_VSET_ENABLE : R/W; bitpos: [26]; default: 1;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_FIB_VSET_ENABLE    BIT(26)
#define LP_SYSTEM_REG_LP_FIB_VSET_ENABLE_M  (LP_SYSTEM_REG_LP_FIB_VSET_ENABLE_V << LP_SYSTEM_REG_LP_FIB_VSET_ENABLE_S)
#define LP_SYSTEM_REG_LP_FIB_VSET_ENABLE_V  0x00000001U
#define LP_SYSTEM_REG_LP_FIB_VSET_ENABLE_S  26
/** LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_CLR : WT; bitpos: [29]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_CLR    (BIT(29))
#define LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_CLR_M  (LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_CLR_V << LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_CLR_S)
#define LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_CLR_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_CLR_S  29
/** LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG : R/WTC/SS; bitpos: [30]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG    (BIT(30))
#define LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_M  (LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_V << LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_S)
#define LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_S  30
/** LP_SYSTEM_REG_SYSTIMER_STALL_SEL : R/W; bitpos: [31]; default: 0;
 *  0: use systimer_stall signal from hp_core0, 1: use systimer_stall signal from
 *  hp_core1
 */
#define LP_SYSTEM_REG_SYSTIMER_STALL_SEL    (BIT(31))
#define LP_SYSTEM_REG_SYSTIMER_STALL_SEL_M  (LP_SYSTEM_REG_SYSTIMER_STALL_SEL_V << LP_SYSTEM_REG_SYSTIMER_STALL_SEL_S)
#define LP_SYSTEM_REG_SYSTIMER_STALL_SEL_V  0x00000001U
#define LP_SYSTEM_REG_SYSTIMER_STALL_SEL_S  31

