espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_system_reg.h
/** LP_SYSTEM_REG_LP_CLK_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CLK_CTRL_REG (DR_REG_LP_SYS_BASE + 0xc)
/** LP_SYSTEM_REG_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define LP_SYSTEM_REG_CLK_EN    (BIT(0))
#define LP_SYSTEM_REG_CLK_EN_M  (LP_SYSTEM_REG_CLK_EN_V << LP_SYSTEM_REG_CLK_EN_S)
#define LP_SYSTEM_REG_CLK_EN_V  0x00000001U
#define LP_SYSTEM_REG_CLK_EN_S  0
/** LP_SYSTEM_REG_LP_FOSC_HP_CKEN : R/W; bitpos: [14]; default: 1;
 *  reserved
 */
#define LP_SYSTEM_REG_LP_FOSC_HP_CKEN    (BIT(14))
#define LP_SYSTEM_REG_LP_FOSC_HP_CKEN_M  (LP_SYSTEM_REG_LP_FOSC_HP_CKEN_V << LP_SYSTEM_REG_LP_FOSC_HP_CKEN_S)
#define LP_SYSTEM_REG_LP_FOSC_HP_CKEN_V  0x00000001U
#define LP_SYSTEM_REG_LP_FOSC_HP_CKEN_S  14

/** LP_SYSTEM_REG_LP_RST_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_RST_CTRL_REG (DR_REG_LP_SYS_BASE + 0x10)
/** LP_SYSTEM_REG_ANA_RST_BYPASS : R/W; bitpos: [0]; default: 1;
 *  analog source reset bypass : wdt,brown out,super wdt,glitch
 */
#define LP_SYSTEM_REG_ANA_RST_BYPASS    (BIT(0))
#define LP_SYSTEM_REG_ANA_RST_BYPASS_M  (LP_SYSTEM_REG_ANA_RST_BYPASS_V << LP_SYSTEM_REG_ANA_RST_BYPASS_S)
#define LP_SYSTEM_REG_ANA_RST_BYPASS_V  0x00000001U
#define LP_SYSTEM_REG_ANA_RST_BYPASS_S  0
/** LP_SYSTEM_REG_SYS_RST_BYPASS : R/W; bitpos: [1]; default: 1;
 *  system source reset bypass : software reset,hp wdt,lp wdt,efuse
 */
#define LP_SYSTEM_REG_SYS_RST_BYPASS    (BIT(1))
#define LP_SYSTEM_REG_SYS_RST_BYPASS_M  (LP_SYSTEM_REG_SYS_RST_BYPASS_V << LP_SYSTEM_REG_SYS_RST_BYPASS_S)
#define LP_SYSTEM_REG_SYS_RST_BYPASS_V  0x00000001U
#define LP_SYSTEM_REG_SYS_RST_BYPASS_S  1
/** LP_SYSTEM_REG_EFUSE_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  efuse force no reset control
 */
#define LP_SYSTEM_REG_EFUSE_FORCE_NORST    (BIT(2))
#define LP_SYSTEM_REG_EFUSE_FORCE_NORST_M  (LP_SYSTEM_REG_EFUSE_FORCE_NORST_V << LP_SYSTEM_REG_EFUSE_FORCE_NORST_S)
#define LP_SYSTEM_REG_EFUSE_FORCE_NORST_V  0x00000001U
#define LP_SYSTEM_REG_EFUSE_FORCE_NORST_S  2

/** LP_SYSTEM_REG_LP_CORE_BOOT_ADDR_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CORE_BOOT_ADDR_REG (DR_REG_LP_SYS_BASE + 0x18)
/** LP_SYSTEM_REG_LP_CPU_BOOT_ADDR : R/W; bitpos: [31:0]; default: 1343225856;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CPU_BOOT_ADDR    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_CPU_BOOT_ADDR_M  (LP_SYSTEM_REG_LP_CPU_BOOT_ADDR_V << LP_SYSTEM_REG_LP_CPU_BOOT_ADDR_S)
#define LP_SYSTEM_REG_LP_CPU_BOOT_ADDR_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_CPU_BOOT_ADDR_S  0

/** LP_SYSTEM_REG_EXT_WAKEUP1_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_EXT_WAKEUP1_REG (DR_REG_LP_SYS_BASE + 0x1c)
/** LP_SYSTEM_REG_EXT_WAKEUP1_SEL : R/W; bitpos: [15:0]; default: 0;
 *  Bitmap to select RTC pads for ext wakeup1
 */
#define LP_SYSTEM_REG_EXT_WAKEUP1_SEL    0x0000FFFFU
#define LP_SYSTEM_REG_EXT_WAKEUP1_SEL_M  (LP_SYSTEM_REG_EXT_WAKEUP1_SEL_V << LP_SYSTEM_REG_EXT_WAKEUP1_SEL_S)
#define LP_SYSTEM_REG_EXT_WAKEUP1_SEL_V  0x0000FFFFU
#define LP_SYSTEM_REG_EXT_WAKEUP1_SEL_S  0
/** LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_CLR : WT; bitpos: [16]; default: 0;
 *  clear ext wakeup1 status
 */
#define LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_CLR    (BIT(16))
#define LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_CLR_M  (LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_CLR_V << LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_CLR_S)
#define LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_CLR_V  0x00000001U
#define LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_CLR_S  16

/** LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_REG (DR_REG_LP_SYS_BASE + 0x20)
/** LP_SYSTEM_REG_EXT_WAKEUP1_STATUS : RO; bitpos: [15:0]; default: 0;
 *  ext wakeup1 status
 */
#define LP_SYSTEM_REG_EXT_WAKEUP1_STATUS    0x0000FFFFU
#define LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_M  (LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_V << LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_S)
#define LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_V  0x0000FFFFU
#define LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_S  0

/** LP_SYSTEM_REG_LP_TCM_PWR_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_PWR_CTRL_REG (DR_REG_LP_SYS_BASE + 0x24)
/** LP_SYSTEM_REG_LP_TCM_ROM_CLK_FORCE_ON : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_ROM_CLK_FORCE_ON    (BIT(5))
#define LP_SYSTEM_REG_LP_TCM_ROM_CLK_FORCE_ON_M  (LP_SYSTEM_REG_LP_TCM_ROM_CLK_FORCE_ON_V << LP_SYSTEM_REG_LP_TCM_ROM_CLK_FORCE_ON_S)
#define LP_SYSTEM_REG_LP_TCM_ROM_CLK_FORCE_ON_V  0x00000001U
#define LP_SYSTEM_REG_LP_TCM_ROM_CLK_FORCE_ON_S  5
/** LP_SYSTEM_REG_LP_TCM_RAM_CLK_FORCE_ON : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_RAM_CLK_FORCE_ON    (BIT(7))
#define LP_SYSTEM_REG_LP_TCM_RAM_CLK_FORCE_ON_M  (LP_SYSTEM_REG_LP_TCM_RAM_CLK_FORCE_ON_V << LP_SYSTEM_REG_LP_TCM_RAM_CLK_FORCE_ON_S)
#define LP_SYSTEM_REG_LP_TCM_RAM_CLK_FORCE_ON_V  0x00000001U
#define LP_SYSTEM_REG_LP_TCM_RAM_CLK_FORCE_ON_S  7

/** LP_SYSTEM_REG_BOOT_ADDR_HP_LP_REG_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_BOOT_ADDR_HP_LP_REG_REG (DR_REG_LP_SYS_BASE + 0x28)
/** LP_SYSTEM_REG_BOOT_ADDR_HP_LP : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_BOOT_ADDR_HP_LP    0xFFFFFFFFU
#define LP_SYSTEM_REG_BOOT_ADDR_HP_LP_M  (LP_SYSTEM_REG_BOOT_ADDR_HP_LP_V << LP_SYSTEM_REG_BOOT_ADDR_HP_LP_S)
#define LP_SYSTEM_REG_BOOT_ADDR_HP_LP_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_BOOT_ADDR_HP_LP_S  0

/** LP_SYSTEM_REG_LP_STORE0_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_STORE0_REG (DR_REG_LP_SYS_BASE + 0x2c)
/** LP_SYSTEM_REG_LP_SCRATCH0 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SCRATCH0    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH0_M  (LP_SYSTEM_REG_LP_SCRATCH0_V << LP_SYSTEM_REG_LP_SCRATCH0_S)
#define LP_SYSTEM_REG_LP_SCRATCH0_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH0_S  0

/** LP_SYSTEM_REG_LP_STORE1_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_STORE1_REG (DR_REG_LP_SYS_BASE + 0x30)
/** LP_SYSTEM_REG_LP_SCRATCH1 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SCRATCH1    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH1_M  (LP_SYSTEM_REG_LP_SCRATCH1_V << LP_SYSTEM_REG_LP_SCRATCH1_S)
#define LP_SYSTEM_REG_LP_SCRATCH1_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH1_S  0

/** LP_SYSTEM_REG_LP_STORE2_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_STORE2_REG (DR_REG_LP_SYS_BASE + 0x34)
/** LP_SYSTEM_REG_LP_SCRATCH2 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SCRATCH2    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH2_M  (LP_SYSTEM_REG_LP_SCRATCH2_V << LP_SYSTEM_REG_LP_SCRATCH2_S)
#define LP_SYSTEM_REG_LP_SCRATCH2_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH2_S  0

