espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_system_reg.h
/** LP_SYSTEM_REG_LP_PROBE_OUT_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_PROBE_OUT_REG (DR_REG_LP_SYS_BASE + 0x74)
/** LP_SYSTEM_REG_PROBE_TOP_OUT : RO; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_PROBE_TOP_OUT    0xFFFFFFFFU
#define LP_SYSTEM_REG_PROBE_TOP_OUT_M  (LP_SYSTEM_REG_PROBE_TOP_OUT_V << LP_SYSTEM_REG_PROBE_TOP_OUT_S)
#define LP_SYSTEM_REG_PROBE_TOP_OUT_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_PROBE_TOP_OUT_S  0

/** LP_SYSTEM_REG_F2S_APB_BRG_CNTL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_F2S_APB_BRG_CNTL_REG (DR_REG_LP_SYS_BASE + 0x9c)
/** LP_SYSTEM_REG_F2S_APB_POSTW_EN : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define LP_SYSTEM_REG_F2S_APB_POSTW_EN    (BIT(0))
#define LP_SYSTEM_REG_F2S_APB_POSTW_EN_M  (LP_SYSTEM_REG_F2S_APB_POSTW_EN_V << LP_SYSTEM_REG_F2S_APB_POSTW_EN_S)
#define LP_SYSTEM_REG_F2S_APB_POSTW_EN_V  0x00000001U
#define LP_SYSTEM_REG_F2S_APB_POSTW_EN_S  0

/** LP_SYSTEM_REG_USB_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_USB_CTRL_REG (DR_REG_LP_SYS_BASE + 0x100)
/** LP_SYSTEM_REG_SW_HW_USB_PHY_SEL : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_SW_HW_USB_PHY_SEL    (BIT(0))
#define LP_SYSTEM_REG_SW_HW_USB_PHY_SEL_M  (LP_SYSTEM_REG_SW_HW_USB_PHY_SEL_V << LP_SYSTEM_REG_SW_HW_USB_PHY_SEL_S)
#define LP_SYSTEM_REG_SW_HW_USB_PHY_SEL_V  0x00000001U
#define LP_SYSTEM_REG_SW_HW_USB_PHY_SEL_S  0
/** LP_SYSTEM_REG_SW_USB_PHY_SEL : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_SW_USB_PHY_SEL    (BIT(1))
#define LP_SYSTEM_REG_SW_USB_PHY_SEL_M  (LP_SYSTEM_REG_SW_USB_PHY_SEL_V << LP_SYSTEM_REG_SW_USB_PHY_SEL_S)
#define LP_SYSTEM_REG_SW_USB_PHY_SEL_V  0x00000001U
#define LP_SYSTEM_REG_SW_USB_PHY_SEL_S  1
/** LP_SYSTEM_REG_USBOTG20_WAKEUP_CLR : WT; bitpos: [2]; default: 0;
 *  clear usb wakeup to PMU.
 */
#define LP_SYSTEM_REG_USBOTG20_WAKEUP_CLR    (BIT(2))
#define LP_SYSTEM_REG_USBOTG20_WAKEUP_CLR_M  (LP_SYSTEM_REG_USBOTG20_WAKEUP_CLR_V << LP_SYSTEM_REG_USBOTG20_WAKEUP_CLR_S)
#define LP_SYSTEM_REG_USBOTG20_WAKEUP_CLR_V  0x00000001U
#define LP_SYSTEM_REG_USBOTG20_WAKEUP_CLR_S  2
/** LP_SYSTEM_REG_USBOTG20_IN_SUSPEND : R/W; bitpos: [3]; default: 0;
 *  indicate usb otg2.0 is in suspend state.
 */
#define LP_SYSTEM_REG_USBOTG20_IN_SUSPEND    (BIT(3))
#define LP_SYSTEM_REG_USBOTG20_IN_SUSPEND_M  (LP_SYSTEM_REG_USBOTG20_IN_SUSPEND_V << LP_SYSTEM_REG_USBOTG20_IN_SUSPEND_S)
#define LP_SYSTEM_REG_USBOTG20_IN_SUSPEND_V  0x00000001U
#define LP_SYSTEM_REG_USBOTG20_IN_SUSPEND_S  3

/** LP_SYSTEM_REG_ANA_XPD_PAD_GROUP_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_ANA_XPD_PAD_GROUP_REG (DR_REG_LP_SYS_BASE + 0x10c)
/** LP_SYSTEM_REG_ANA_REG_XPD_PAD_GROUP : R/W; bitpos: [7:0]; default: 255;
 *  Set 1 to power up pad group
 */
#define LP_SYSTEM_REG_ANA_REG_XPD_PAD_GROUP    0x000000FFU
#define LP_SYSTEM_REG_ANA_REG_XPD_PAD_GROUP_M  (LP_SYSTEM_REG_ANA_REG_XPD_PAD_GROUP_V << LP_SYSTEM_REG_ANA_REG_XPD_PAD_GROUP_S)
#define LP_SYSTEM_REG_ANA_REG_XPD_PAD_GROUP_V  0x000000FFU
#define LP_SYSTEM_REG_ANA_REG_XPD_PAD_GROUP_S  0

/** LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_CS_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_CS_REG (DR_REG_LP_SYS_BASE + 0x110)
/** LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_EN    (BIT(0))
#define LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_EN_M  (LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_EN_V << LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_EN_S)
#define LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_EN_V  0x00000001U
#define LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_EN_S  0
/** LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_RESULT : RO; bitpos: [1]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_RESULT    (BIT(1))
#define LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_RESULT_M  (LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_RESULT_V << LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_RESULT_S)
#define LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_RESULT_V  0x00000001U
#define LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_RESULT_S  1

/** LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_LOW_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_LOW_REG (DR_REG_LP_SYS_BASE + 0x114)
/** LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_LOW    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_LOW_M  (LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_LOW_V << LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_LOW_S)
#define LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_LOW_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_LOW_S  0

/** LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_HIGH_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_HIGH_REG (DR_REG_LP_SYS_BASE + 0x118)
/** LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_HIGH : R/W; bitpos: [31:0]; default: 4294967295;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_HIGH    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_HIGH_M  (LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_HIGH_V << LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_HIGH_S)
#define LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_HIGH_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_TCM_RAM_RDN_ECO_HIGH_S  0

/** LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_CS_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_CS_REG (DR_REG_LP_SYS_BASE + 0x11c)
/** LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_EN    (BIT(0))
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_EN_M  (LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_EN_V << LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_EN_S)
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_EN_V  0x00000001U
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_EN_S  0
/** LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_RESULT : RO; bitpos: [1]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_RESULT    (BIT(1))
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_RESULT_M  (LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_RESULT_V << LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_RESULT_S)
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_RESULT_V  0x00000001U
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_RESULT_S  1

