espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_system_reg.h
/** LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_LOW_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_LOW_REG (DR_REG_LP_SYS_BASE + 0x120)
/** LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_LOW    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_LOW_M  (LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_LOW_V << LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_LOW_S)
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_LOW_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_LOW_S  0

/** LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_HIGH_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_HIGH_REG (DR_REG_LP_SYS_BASE + 0x124)
/** LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_HIGH : R/W; bitpos: [31:0]; default: 4294967295;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_HIGH    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_HIGH_M  (LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_HIGH_V << LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_HIGH_S)
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_HIGH_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_HIGH_S  0

/** LP_SYSTEM_REG_HP_ROOT_CLK_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_HP_ROOT_CLK_CTRL_REG (DR_REG_LP_SYS_BASE + 0x130)
/** LP_SYSTEM_REG_CPU_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  clock gate enable for hp cpu root 400M clk
 */
#define LP_SYSTEM_REG_CPU_CLK_EN    (BIT(0))
#define LP_SYSTEM_REG_CPU_CLK_EN_M  (LP_SYSTEM_REG_CPU_CLK_EN_V << LP_SYSTEM_REG_CPU_CLK_EN_S)
#define LP_SYSTEM_REG_CPU_CLK_EN_V  0x00000001U
#define LP_SYSTEM_REG_CPU_CLK_EN_S  0
/** LP_SYSTEM_REG_SYS_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  clock gate enable for hp sys root 480M clk
 */
#define LP_SYSTEM_REG_SYS_CLK_EN    (BIT(1))
#define LP_SYSTEM_REG_SYS_CLK_EN_M  (LP_SYSTEM_REG_SYS_CLK_EN_V << LP_SYSTEM_REG_SYS_CLK_EN_S)
#define LP_SYSTEM_REG_SYS_CLK_EN_V  0x00000001U
#define LP_SYSTEM_REG_SYS_CLK_EN_S  1

/** LP_SYSTEM_REG_LP_PMU_RDN_ECO_LOW_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_PMU_RDN_ECO_LOW_REG (DR_REG_LP_SYS_BASE + 0x138)
/** LP_SYSTEM_REG_PMU_RDN_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_PMU_RDN_ECO_LOW    0xFFFFFFFFU
#define LP_SYSTEM_REG_PMU_RDN_ECO_LOW_M  (LP_SYSTEM_REG_PMU_RDN_ECO_LOW_V << LP_SYSTEM_REG_PMU_RDN_ECO_LOW_S)
#define LP_SYSTEM_REG_PMU_RDN_ECO_LOW_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_PMU_RDN_ECO_LOW_S  0

/** LP_SYSTEM_REG_LP_PMU_RDN_ECO_HIGH_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_PMU_RDN_ECO_HIGH_REG (DR_REG_LP_SYS_BASE + 0x13c)
/** LP_SYSTEM_REG_PMU_RDN_ECO_HIGH : R/W; bitpos: [31:0]; default: 4294967295;
 *  need_des
 */
#define LP_SYSTEM_REG_PMU_RDN_ECO_HIGH    0xFFFFFFFFU
#define LP_SYSTEM_REG_PMU_RDN_ECO_HIGH_M  (LP_SYSTEM_REG_PMU_RDN_ECO_HIGH_V << LP_SYSTEM_REG_PMU_RDN_ECO_HIGH_S)
#define LP_SYSTEM_REG_PMU_RDN_ECO_HIGH_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_PMU_RDN_ECO_HIGH_S  0

/** LP_SYSTEM_REG_PAD_COMP0_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_PAD_COMP0_REG (DR_REG_LP_SYS_BASE + 0x148)
/** LP_SYSTEM_REG_DREF_COMP0 : R/W; bitpos: [2:0]; default: 0;
 *  pad comp dref
 */
#define LP_SYSTEM_REG_DREF_COMP0    0x00000007U
#define LP_SYSTEM_REG_DREF_COMP0_M  (LP_SYSTEM_REG_DREF_COMP0_V << LP_SYSTEM_REG_DREF_COMP0_S)
#define LP_SYSTEM_REG_DREF_COMP0_V  0x00000007U
#define LP_SYSTEM_REG_DREF_COMP0_S  0
/** LP_SYSTEM_REG_MODE_COMP0 : R/W; bitpos: [3]; default: 0;
 *  pad comp mode
 */
#define LP_SYSTEM_REG_MODE_COMP0    (BIT(3))
#define LP_SYSTEM_REG_MODE_COMP0_M  (LP_SYSTEM_REG_MODE_COMP0_V << LP_SYSTEM_REG_MODE_COMP0_S)
#define LP_SYSTEM_REG_MODE_COMP0_V  0x00000001U
#define LP_SYSTEM_REG_MODE_COMP0_S  3
/** LP_SYSTEM_REG_XPD_COMP0 : R/W; bitpos: [4]; default: 0;
 *  pad comp xpd
 */
#define LP_SYSTEM_REG_XPD_COMP0    (BIT(4))
#define LP_SYSTEM_REG_XPD_COMP0_M  (LP_SYSTEM_REG_XPD_COMP0_V << LP_SYSTEM_REG_XPD_COMP0_S)
#define LP_SYSTEM_REG_XPD_COMP0_V  0x00000001U
#define LP_SYSTEM_REG_XPD_COMP0_S  4

/** LP_SYSTEM_REG_PAD_COMP1_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_PAD_COMP1_REG (DR_REG_LP_SYS_BASE + 0x14c)
/** LP_SYSTEM_REG_DREF_COMP1 : R/W; bitpos: [2:0]; default: 0;
 *  pad comp dref
 */
#define LP_SYSTEM_REG_DREF_COMP1    0x00000007U
#define LP_SYSTEM_REG_DREF_COMP1_M  (LP_SYSTEM_REG_DREF_COMP1_V << LP_SYSTEM_REG_DREF_COMP1_S)
#define LP_SYSTEM_REG_DREF_COMP1_V  0x00000007U
#define LP_SYSTEM_REG_DREF_COMP1_S  0
/** LP_SYSTEM_REG_MODE_COMP1 : R/W; bitpos: [3]; default: 0;
 *  pad comp mode
 */
#define LP_SYSTEM_REG_MODE_COMP1    (BIT(3))
#define LP_SYSTEM_REG_MODE_COMP1_M  (LP_SYSTEM_REG_MODE_COMP1_V << LP_SYSTEM_REG_MODE_COMP1_S)
#define LP_SYSTEM_REG_MODE_COMP1_V  0x00000001U
#define LP_SYSTEM_REG_MODE_COMP1_S  3
/** LP_SYSTEM_REG_XPD_COMP1 : R/W; bitpos: [4]; default: 0;
 *  pad comp xpd
 */
#define LP_SYSTEM_REG_XPD_COMP1    (BIT(4))
#define LP_SYSTEM_REG_XPD_COMP1_M  (LP_SYSTEM_REG_XPD_COMP1_V << LP_SYSTEM_REG_XPD_COMP1_S)
#define LP_SYSTEM_REG_XPD_COMP1_V  0x00000001U
#define LP_SYSTEM_REG_XPD_COMP1_S  4

/** LP_SYSTEM_REG_BACKUP_DMA_CFG0_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_BACKUP_DMA_CFG0_REG (DR_REG_LP_SYS_BASE + 0x154)
/** LP_SYSTEM_REG_BURST_LIMIT_AON : R/W; bitpos: [4:0]; default: 10;
 *  need_des
 */
#define LP_SYSTEM_REG_BURST_LIMIT_AON    0x0000001FU
#define LP_SYSTEM_REG_BURST_LIMIT_AON_M  (LP_SYSTEM_REG_BURST_LIMIT_AON_V << LP_SYSTEM_REG_BURST_LIMIT_AON_S)
#define LP_SYSTEM_REG_BURST_LIMIT_AON_V  0x0000001FU
#define LP_SYSTEM_REG_BURST_LIMIT_AON_S  0
/** LP_SYSTEM_REG_READ_INTERVAL_AON : R/W; bitpos: [11:5]; default: 10;
 *  need_des
 */
#define LP_SYSTEM_REG_READ_INTERVAL_AON    0x0000007FU
#define LP_SYSTEM_REG_READ_INTERVAL_AON_M  (LP_SYSTEM_REG_READ_INTERVAL_AON_V << LP_SYSTEM_REG_READ_INTERVAL_AON_S)
#define LP_SYSTEM_REG_READ_INTERVAL_AON_V  0x0000007FU
#define LP_SYSTEM_REG_READ_INTERVAL_AON_S  5
/** LP_SYSTEM_REG_LINK_BACKUP_TOUT_THRES_AON : R/W; bitpos: [21:12]; default: 100;
 *  need_des
 */
#define LP_SYSTEM_REG_LINK_BACKUP_TOUT_THRES_AON    0x000003FFU
#define LP_SYSTEM_REG_LINK_BACKUP_TOUT_THRES_AON_M  (LP_SYSTEM_REG_LINK_BACKUP_TOUT_THRES_AON_V << LP_SYSTEM_REG_LINK_BACKUP_TOUT_THRES_AON_S)
#define LP_SYSTEM_REG_LINK_BACKUP_TOUT_THRES_AON_V  0x000003FFU
#define LP_SYSTEM_REG_LINK_BACKUP_TOUT_THRES_AON_S  12
/** LP_SYSTEM_REG_LINK_TOUT_THRES_AON : R/W; bitpos: [31:22]; default: 100;
 *  need_des
 */
#define LP_SYSTEM_REG_LINK_TOUT_THRES_AON    0x000003FFU
#define LP_SYSTEM_REG_LINK_TOUT_THRES_AON_M  (LP_SYSTEM_REG_LINK_TOUT_THRES_AON_V << LP_SYSTEM_REG_LINK_TOUT_THRES_AON_S)
#define LP_SYSTEM_REG_LINK_TOUT_THRES_AON_V  0x000003FFU
#define LP_SYSTEM_REG_LINK_TOUT_THRES_AON_S  22

