espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_system_reg.h
/** LP_SYSTEM_REG_BACKUP_DMA_CFG1_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_BACKUP_DMA_CFG1_REG (DR_REG_LP_SYS_BASE + 0x158)
/** LP_SYSTEM_REG_AON_BYPASS : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_AON_BYPASS    (BIT(31))
#define LP_SYSTEM_REG_AON_BYPASS_M  (LP_SYSTEM_REG_AON_BYPASS_V << LP_SYSTEM_REG_AON_BYPASS_S)
#define LP_SYSTEM_REG_AON_BYPASS_V  0x00000001U
#define LP_SYSTEM_REG_AON_BYPASS_S  31

/** LP_SYSTEM_REG_BACKUP_DMA_CFG2_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_BACKUP_DMA_CFG2_REG (DR_REG_LP_SYS_BASE + 0x15c)
/** LP_SYSTEM_REG_LINK_ADDR_AON : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LINK_ADDR_AON    0xFFFFFFFFU
#define LP_SYSTEM_REG_LINK_ADDR_AON_M  (LP_SYSTEM_REG_LINK_ADDR_AON_V << LP_SYSTEM_REG_LINK_ADDR_AON_S)
#define LP_SYSTEM_REG_LINK_ADDR_AON_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LINK_ADDR_AON_S  0

/** LP_SYSTEM_REG_BOOT_ADDR_HP_CORE1_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_BOOT_ADDR_HP_CORE1_REG (DR_REG_LP_SYS_BASE + 0x164)
/** LP_SYSTEM_REG_BOOT_ADDR_HP_CORE1 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_BOOT_ADDR_HP_CORE1    0xFFFFFFFFU
#define LP_SYSTEM_REG_BOOT_ADDR_HP_CORE1_M  (LP_SYSTEM_REG_BOOT_ADDR_HP_CORE1_V << LP_SYSTEM_REG_BOOT_ADDR_HP_CORE1_S)
#define LP_SYSTEM_REG_BOOT_ADDR_HP_CORE1_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_BOOT_ADDR_HP_CORE1_S  0

/** LP_SYSTEM_REG_LP_ADDRHOLE_ADDR_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_ADDRHOLE_ADDR_REG (DR_REG_LP_SYS_BASE + 0x168)
/** LP_SYSTEM_REG_LP_ADDRHOLE_ADDR : RO; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_ADDRHOLE_ADDR    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_ADDRHOLE_ADDR_M  (LP_SYSTEM_REG_LP_ADDRHOLE_ADDR_V << LP_SYSTEM_REG_LP_ADDRHOLE_ADDR_S)
#define LP_SYSTEM_REG_LP_ADDRHOLE_ADDR_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_ADDRHOLE_ADDR_S  0

/** LP_SYSTEM_REG_LP_ADDRHOLE_INFO_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_ADDRHOLE_INFO_REG (DR_REG_LP_SYS_BASE + 0x16c)
/** LP_SYSTEM_REG_LP_ADDRHOLE_ID : RO; bitpos: [4:0]; default: 0;
 *  master id: 5'h0: hp core0, 5'h1:hp core1, 5'h2:lp core, 5'h3:usb otg11, 5'h4:
 *  regdma, 5'h5: gmac, 5'h5 sdmmc, 5'h7: usbotg20, 5'h8: trace0, 5'h9: trace1, 5'ha
 *  tcm monitor, 5'hb: l2mem monitor. 5'h10~5'h1f: ahb pdma.
 */
#define LP_SYSTEM_REG_LP_ADDRHOLE_ID    0x0000001FU
#define LP_SYSTEM_REG_LP_ADDRHOLE_ID_M  (LP_SYSTEM_REG_LP_ADDRHOLE_ID_V << LP_SYSTEM_REG_LP_ADDRHOLE_ID_S)
#define LP_SYSTEM_REG_LP_ADDRHOLE_ID_V  0x0000001FU
#define LP_SYSTEM_REG_LP_ADDRHOLE_ID_S  0
/** LP_SYSTEM_REG_LP_ADDRHOLE_WR : RO; bitpos: [5]; default: 0;
 *  1:write trans, 0: read trans.
 */
#define LP_SYSTEM_REG_LP_ADDRHOLE_WR    (BIT(5))
#define LP_SYSTEM_REG_LP_ADDRHOLE_WR_M  (LP_SYSTEM_REG_LP_ADDRHOLE_WR_V << LP_SYSTEM_REG_LP_ADDRHOLE_WR_S)
#define LP_SYSTEM_REG_LP_ADDRHOLE_WR_V  0x00000001U
#define LP_SYSTEM_REG_LP_ADDRHOLE_WR_S  5
/** LP_SYSTEM_REG_LP_ADDRHOLE_SECURE : RO; bitpos: [6]; default: 0;
 *  1: illegal address access, 0: access without permission
 */
#define LP_SYSTEM_REG_LP_ADDRHOLE_SECURE    (BIT(6))
#define LP_SYSTEM_REG_LP_ADDRHOLE_SECURE_M  (LP_SYSTEM_REG_LP_ADDRHOLE_SECURE_V << LP_SYSTEM_REG_LP_ADDRHOLE_SECURE_S)
#define LP_SYSTEM_REG_LP_ADDRHOLE_SECURE_V  0x00000001U
#define LP_SYSTEM_REG_LP_ADDRHOLE_SECURE_S  6

/** LP_SYSTEM_REG_INT_RAW_REG register
 *  raw interrupt register
 */
#define LP_SYSTEM_REG_INT_RAW_REG (DR_REG_LP_SYS_BASE + 0x170)
/** LP_SYSTEM_REG_LP_ADDRHOLE_INT_RAW : R/SS/WTC; bitpos: [0]; default: 0;
 *  the raw interrupt status of lp addrhole(for lp peri  and lp ram tee apm, and lp
 *  matrix default slave)
 */
#define LP_SYSTEM_REG_LP_ADDRHOLE_INT_RAW    (BIT(0))
#define LP_SYSTEM_REG_LP_ADDRHOLE_INT_RAW_M  (LP_SYSTEM_REG_LP_ADDRHOLE_INT_RAW_V << LP_SYSTEM_REG_LP_ADDRHOLE_INT_RAW_S)
#define LP_SYSTEM_REG_LP_ADDRHOLE_INT_RAW_V  0x00000001U
#define LP_SYSTEM_REG_LP_ADDRHOLE_INT_RAW_S  0
/** LP_SYSTEM_REG_IDBUS_ADDRHOLE_INT_RAW : R/SS/WTC; bitpos: [1]; default: 0;
 *  the raw interrupt status of idbus addrhole(only for lp cpu ibus and dbus)
 */
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_INT_RAW    (BIT(1))
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_INT_RAW_M  (LP_SYSTEM_REG_IDBUS_ADDRHOLE_INT_RAW_V << LP_SYSTEM_REG_IDBUS_ADDRHOLE_INT_RAW_S)
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_INT_RAW_V  0x00000001U
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_INT_RAW_S  1
/** LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_INT_RAW : R/SS/WTC; bitpos: [2]; default: 0;
 *  the raw interrupt status of lp core ahb bus timeout
 */
#define LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_INT_RAW    (BIT(2))
#define LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_INT_RAW_M  (LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_INT_RAW_V << LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_INT_RAW_S)
#define LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_INT_RAW_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_INT_RAW_S  2
/** LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_RAW : R/SS/WTC; bitpos: [3]; default: 0;
 *  the raw interrupt status of lp core  ibus timeout
 */
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_RAW    (BIT(3))
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_RAW_M  (LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_RAW_V << LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_RAW_S)
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_RAW_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_RAW_S  3
/** LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_RAW : R/SS/WTC; bitpos: [4]; default: 0;
 *  the raw interrupt status of lp core  dbus timeout
 */
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_RAW    (BIT(4))
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_RAW_M  (LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_RAW_V << LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_RAW_S)
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_RAW_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_RAW_S  4
/** LP_SYSTEM_REG_ETM_TASK_ULP_INT_RAW : R/SS/WTC; bitpos: [5]; default: 0;
 *  the raw interrupt status of etm task ulp
 */
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_RAW    (BIT(5))
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_RAW_M  (LP_SYSTEM_REG_ETM_TASK_ULP_INT_RAW_V << LP_SYSTEM_REG_ETM_TASK_ULP_INT_RAW_S)
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_RAW_V  0x00000001U
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_RAW_S  5
/** LP_SYSTEM_REG_SLOW_CLK_TICK_INT_RAW : R/SS/WTC; bitpos: [6]; default: 0;
 *  the raw interrupt status of slow_clk_tick
 */
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_RAW    (BIT(6))
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_RAW_M  (LP_SYSTEM_REG_SLOW_CLK_TICK_INT_RAW_V << LP_SYSTEM_REG_SLOW_CLK_TICK_INT_RAW_S)
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_RAW_V  0x00000001U
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_RAW_S  6

