espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_system_reg.h
/** LP_SYSTEM_REG_HP_MEM_AUX_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_HP_MEM_AUX_CTRL_REG (DR_REG_LP_SYS_BASE + 0x180)
/** LP_SYSTEM_REG_HP_MEM_AUX_CTRL : R/W; bitpos: [31:0]; default: 8304;
 *  need_des
 */
#define LP_SYSTEM_REG_HP_MEM_AUX_CTRL    0xFFFFFFFFU
#define LP_SYSTEM_REG_HP_MEM_AUX_CTRL_M  (LP_SYSTEM_REG_HP_MEM_AUX_CTRL_V << LP_SYSTEM_REG_HP_MEM_AUX_CTRL_S)
#define LP_SYSTEM_REG_HP_MEM_AUX_CTRL_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_HP_MEM_AUX_CTRL_S  0

/** LP_SYSTEM_REG_LP_MEM_AUX_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_MEM_AUX_CTRL_REG (DR_REG_LP_SYS_BASE + 0x184)
/** LP_SYSTEM_REG_LP_MEM_AUX_CTRL : R/W; bitpos: [31:0]; default: 8304;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_MEM_AUX_CTRL    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_MEM_AUX_CTRL_M  (LP_SYSTEM_REG_LP_MEM_AUX_CTRL_V << LP_SYSTEM_REG_LP_MEM_AUX_CTRL_S)
#define LP_SYSTEM_REG_LP_MEM_AUX_CTRL_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_MEM_AUX_CTRL_S  0

/** LP_SYSTEM_REG_HP_ROM_AUX_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_HP_ROM_AUX_CTRL_REG (DR_REG_LP_SYS_BASE + 0x188)
/** LP_SYSTEM_REG_HP_ROM_AUX_CTRL : R/W; bitpos: [31:0]; default: 112;
 *  need_des
 */
#define LP_SYSTEM_REG_HP_ROM_AUX_CTRL    0xFFFFFFFFU
#define LP_SYSTEM_REG_HP_ROM_AUX_CTRL_M  (LP_SYSTEM_REG_HP_ROM_AUX_CTRL_V << LP_SYSTEM_REG_HP_ROM_AUX_CTRL_S)
#define LP_SYSTEM_REG_HP_ROM_AUX_CTRL_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_HP_ROM_AUX_CTRL_S  0

/** LP_SYSTEM_REG_LP_ROM_AUX_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_ROM_AUX_CTRL_REG (DR_REG_LP_SYS_BASE + 0x18c)
/** LP_SYSTEM_REG_LP_ROM_AUX_CTRL : R/W; bitpos: [31:0]; default: 112;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_ROM_AUX_CTRL    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_ROM_AUX_CTRL_M  (LP_SYSTEM_REG_LP_ROM_AUX_CTRL_V << LP_SYSTEM_REG_LP_ROM_AUX_CTRL_S)
#define LP_SYSTEM_REG_LP_ROM_AUX_CTRL_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_ROM_AUX_CTRL_S  0

/** LP_SYSTEM_REG_LP_CPU_DBG_PC_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CPU_DBG_PC_REG (DR_REG_LP_SYS_BASE + 0x190)
/** LP_SYSTEM_REG_LP_CPU_DBG_PC : RO; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CPU_DBG_PC    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_CPU_DBG_PC_M  (LP_SYSTEM_REG_LP_CPU_DBG_PC_V << LP_SYSTEM_REG_LP_CPU_DBG_PC_S)
#define LP_SYSTEM_REG_LP_CPU_DBG_PC_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_CPU_DBG_PC_S  0

/** LP_SYSTEM_REG_LP_CPU_EXC_PC_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CPU_EXC_PC_REG (DR_REG_LP_SYS_BASE + 0x194)
/** LP_SYSTEM_REG_LP_CPU_EXC_PC : RO; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CPU_EXC_PC    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_CPU_EXC_PC_M  (LP_SYSTEM_REG_LP_CPU_EXC_PC_V << LP_SYSTEM_REG_LP_CPU_EXC_PC_S)
#define LP_SYSTEM_REG_LP_CPU_EXC_PC_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_CPU_EXC_PC_S  0

/** LP_SYSTEM_REG_IDBUS_ADDRHOLE_ADDR_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_ADDR_REG (DR_REG_LP_SYS_BASE + 0x198)
/** LP_SYSTEM_REG_IDBUS_ADDRHOLE_ADDR : RO; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_ADDR    0xFFFFFFFFU
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_ADDR_M  (LP_SYSTEM_REG_IDBUS_ADDRHOLE_ADDR_V << LP_SYSTEM_REG_IDBUS_ADDRHOLE_ADDR_S)
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_ADDR_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_ADDR_S  0

/** LP_SYSTEM_REG_IDBUS_ADDRHOLE_INFO_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_INFO_REG (DR_REG_LP_SYS_BASE + 0x19c)
/** LP_SYSTEM_REG_IDBUS_ADDRHOLE_ID : RO; bitpos: [4:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_ID    0x0000001FU
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_ID_M  (LP_SYSTEM_REG_IDBUS_ADDRHOLE_ID_V << LP_SYSTEM_REG_IDBUS_ADDRHOLE_ID_S)
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_ID_V  0x0000001FU
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_ID_S  0
/** LP_SYSTEM_REG_IDBUS_ADDRHOLE_WR : RO; bitpos: [5]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_WR    (BIT(5))
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_WR_M  (LP_SYSTEM_REG_IDBUS_ADDRHOLE_WR_V << LP_SYSTEM_REG_IDBUS_ADDRHOLE_WR_S)
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_WR_V  0x00000001U
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_WR_S  5
/** LP_SYSTEM_REG_IDBUS_ADDRHOLE_SECURE : RO; bitpos: [6]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_SECURE    (BIT(6))
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_SECURE_M  (LP_SYSTEM_REG_IDBUS_ADDRHOLE_SECURE_V << LP_SYSTEM_REG_IDBUS_ADDRHOLE_SECURE_S)
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_SECURE_V  0x00000001U
#define LP_SYSTEM_REG_IDBUS_ADDRHOLE_SECURE_S  6

/** LP_SYSTEM_REG_HP_POR_RST_BYPASS_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_HP_POR_RST_BYPASS_CTRL_REG (DR_REG_LP_SYS_BASE + 0x1a0)
/** LP_SYSTEM_REG_HP_PO_CNNT_RSTN_BYPASS_CTRL : R/W; bitpos: [15:8]; default: 255;
 *  [15] 1'b1: po_cnnt_rstn bypass sys_sw_rstn
 *  [14] 1'b1: po_cnnt_rstn bypass hp_wdt_sys_rstn
 *  [13] 1'b1: po_cnnt_rstn bypass hp_cpu_intrusion_rstn
 *  [12] 1'b1: po_cnnt_rstn bypass hp_sdio_sys_rstn
 *  [11] 1'b1: po_cnnt_rstn bypass usb_jtag_chip_rst
 *  [10] 1'b1: po_cnnt_rstn bypass usb_uart_chip_rst
 *  [9] 1'b1: po_cnnt_rstn bypass lp_wdt_hp_sys_rstn
 *  [8] 1'b1: po_cnnt_rstn bypass efuse_err_rstn
 */
#define LP_SYSTEM_REG_HP_PO_CNNT_RSTN_BYPASS_CTRL    0x000000FFU
#define LP_SYSTEM_REG_HP_PO_CNNT_RSTN_BYPASS_CTRL_M  (LP_SYSTEM_REG_HP_PO_CNNT_RSTN_BYPASS_CTRL_V << LP_SYSTEM_REG_HP_PO_CNNT_RSTN_BYPASS_CTRL_S)
#define LP_SYSTEM_REG_HP_PO_CNNT_RSTN_BYPASS_CTRL_V  0x000000FFU
#define LP_SYSTEM_REG_HP_PO_CNNT_RSTN_BYPASS_CTRL_S  8
/** LP_SYSTEM_REG_HP_PO_RSTN_BYPASS_CTRL : R/W; bitpos: [31:24]; default: 255;
 *  [31] 1'b1: po_rstn bypass sys_sw_rstn
 *  [30] 1'b1: po_rstn bypass hp_wdt_sys_rstn
 *  [29] 1'b1: po_rstn bypass hp_cpu_intrusion_rstn
 *  [28] 1'b1: po_rstn bypass hp_sdio_sys_rstn
 *  [27] 1'b1: po_rstn bypass usb_jtag_chip_rst
 *  [26] 1'b1: po_rstn bypass usb_uart_chip_rst
 *  [25] 1'b1: po_rstn bypass lp_wdt_hp_sys_rstn
 *  [24] 1'b1: po_rstn bypass efuse_err_rstn
 */
#define LP_SYSTEM_REG_HP_PO_RSTN_BYPASS_CTRL    0x000000FFU
#define LP_SYSTEM_REG_HP_PO_RSTN_BYPASS_CTRL_M  (LP_SYSTEM_REG_HP_PO_RSTN_BYPASS_CTRL_V << LP_SYSTEM_REG_HP_PO_RSTN_BYPASS_CTRL_S)
#define LP_SYSTEM_REG_HP_PO_RSTN_BYPASS_CTRL_V  0x000000FFU
#define LP_SYSTEM_REG_HP_PO_RSTN_BYPASS_CTRL_S  24

/** LP_SYSTEM_REG_RNG_DATA_REG register
 *  rng data register
 */
#define LP_SYSTEM_REG_RNG_DATA_REG (DR_REG_LP_SYS_BASE + 0x1a4)
/** LP_SYSTEM_REG_RND_DATA : RO; bitpos: [31:0]; default: 0;
 *  result of rng output
 */
#define LP_SYSTEM_REG_RND_DATA    0xFFFFFFFFU
#define LP_SYSTEM_REG_RND_DATA_M  (LP_SYSTEM_REG_RND_DATA_V << LP_SYSTEM_REG_RND_DATA_S)
#define LP_SYSTEM_REG_RND_DATA_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_RND_DATA_S  0

