espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_system_reg.h
/** LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_REG (DR_REG_LP_SYS_BASE + 0x1b0)
/** LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_EN : R/W; bitpos: [0]; default: 1;
 *  set this field to 1 to enable lp core ahb timeout handle
 */
#define LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_EN    (BIT(0))
#define LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_EN_M  (LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_EN_V << LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_EN_S)
#define LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_EN_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_EN_S  0
/** LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_THRES : R/W; bitpos: [16:1]; default: 65535;
 *  This field used to set lp core ahb bus timeout  threshold
 */
#define LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_THRES    0x0000FFFFU
#define LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_THRES_M  (LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_THRES_V << LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_THRES_S)
#define LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_THRES_V  0x0000FFFFU
#define LP_SYSTEM_REG_LP_CORE_AHB_TIMEOUT_THRES_S  1
/** LP_SYSTEM_REG_LP2HP_AHB_TIMEOUT_EN : R/W; bitpos: [17]; default: 1;
 *  set this field to 1 to enable lp2hp ahb timeout handle
 */
#define LP_SYSTEM_REG_LP2HP_AHB_TIMEOUT_EN    (BIT(17))
#define LP_SYSTEM_REG_LP2HP_AHB_TIMEOUT_EN_M  (LP_SYSTEM_REG_LP2HP_AHB_TIMEOUT_EN_V << LP_SYSTEM_REG_LP2HP_AHB_TIMEOUT_EN_S)
#define LP_SYSTEM_REG_LP2HP_AHB_TIMEOUT_EN_V  0x00000001U
#define LP_SYSTEM_REG_LP2HP_AHB_TIMEOUT_EN_S  17
/** LP_SYSTEM_REG_LP2HP_AHB_TIMEOUT_THRES : R/W; bitpos: [22:18]; default: 31;
 *  This field used to set lp2hp ahb bus timeout  threshold
 */
#define LP_SYSTEM_REG_LP2HP_AHB_TIMEOUT_THRES    0x0000001FU
#define LP_SYSTEM_REG_LP2HP_AHB_TIMEOUT_THRES_M  (LP_SYSTEM_REG_LP2HP_AHB_TIMEOUT_THRES_V << LP_SYSTEM_REG_LP2HP_AHB_TIMEOUT_THRES_S)
#define LP_SYSTEM_REG_LP2HP_AHB_TIMEOUT_THRES_V  0x0000001FU
#define LP_SYSTEM_REG_LP2HP_AHB_TIMEOUT_THRES_S  18

/** LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_REG (DR_REG_LP_SYS_BASE + 0x1b4)
/** LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_EN : R/W; bitpos: [0]; default: 1;
 *  set this field to 1 to enable lp core ibus timeout handle
 */
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_EN    (BIT(0))
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_EN_M  (LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_EN_V << LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_EN_S)
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_EN_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_EN_S  0
/** LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_THRES : R/W; bitpos: [16:1]; default: 65535;
 *  This field used to set lp core ibus timeout  threshold
 */
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_THRES    0x0000FFFFU
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_THRES_M  (LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_THRES_V << LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_THRES_S)
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_THRES_V  0x0000FFFFU
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_THRES_S  1

/** LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_REG (DR_REG_LP_SYS_BASE + 0x1b8)
/** LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_EN : R/W; bitpos: [0]; default: 1;
 *  set this field to 1 to enable lp core dbus timeout handle
 */
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_EN    (BIT(0))
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_EN_M  (LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_EN_V << LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_EN_S)
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_EN_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_EN_S  0
/** LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_THRES : R/W; bitpos: [16:1]; default: 65535;
 *  This field used to set lp core dbus timeout  threshold
 */
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_THRES    0x0000FFFFU
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_THRES_M  (LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_THRES_V << LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_THRES_S)
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_THRES_V  0x0000FFFFU
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_THRES_S  1

/** LP_SYSTEM_REG_LP_CORE_ERR_RESP_DIS_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CORE_ERR_RESP_DIS_REG (DR_REG_LP_SYS_BASE + 0x1bc)
/** LP_SYSTEM_REG_LP_CORE_ERR_RESP_DIS : R/W; bitpos: [2:0]; default: 0;
 *  Set bit0 to disable ibus err resp;Set bit1 to disable dbus err resp; Set bit 2 to
 *  disable ahb err resp.
 */
#define LP_SYSTEM_REG_LP_CORE_ERR_RESP_DIS    0x00000007U
#define LP_SYSTEM_REG_LP_CORE_ERR_RESP_DIS_M  (LP_SYSTEM_REG_LP_CORE_ERR_RESP_DIS_V << LP_SYSTEM_REG_LP_CORE_ERR_RESP_DIS_S)
#define LP_SYSTEM_REG_LP_CORE_ERR_RESP_DIS_V  0x00000007U
#define LP_SYSTEM_REG_LP_CORE_ERR_RESP_DIS_S  0

/** LP_SYSTEM_REG_RNG_CFG_REG register
 *  rng cfg register
 */
#define LP_SYSTEM_REG_RNG_CFG_REG (DR_REG_LP_SYS_BASE + 0x1c0)
/** LP_SYSTEM_REG_RNG_TIMER_EN : R/W; bitpos: [0]; default: 1;
 *  enable rng timer
 */
#define LP_SYSTEM_REG_RNG_TIMER_EN    (BIT(0))
#define LP_SYSTEM_REG_RNG_TIMER_EN_M  (LP_SYSTEM_REG_RNG_TIMER_EN_V << LP_SYSTEM_REG_RNG_TIMER_EN_S)
#define LP_SYSTEM_REG_RNG_TIMER_EN_V  0x00000001U
#define LP_SYSTEM_REG_RNG_TIMER_EN_S  0
/** LP_SYSTEM_REG_RNG_TIMER_PSCALE : R/W; bitpos: [8:1]; default: 1;
 *  configure ng timer pscale
 */
#define LP_SYSTEM_REG_RNG_TIMER_PSCALE    0x000000FFU
#define LP_SYSTEM_REG_RNG_TIMER_PSCALE_M  (LP_SYSTEM_REG_RNG_TIMER_PSCALE_V << LP_SYSTEM_REG_RNG_TIMER_PSCALE_S)
#define LP_SYSTEM_REG_RNG_TIMER_PSCALE_V  0x000000FFU
#define LP_SYSTEM_REG_RNG_TIMER_PSCALE_S  1
/** LP_SYSTEM_REG_RNG_SAR_ENABLE : R/W; bitpos: [9]; default: 0;
 *  enable rng_saradc
 */
#define LP_SYSTEM_REG_RNG_SAR_ENABLE    (BIT(9))
#define LP_SYSTEM_REG_RNG_SAR_ENABLE_M  (LP_SYSTEM_REG_RNG_SAR_ENABLE_V << LP_SYSTEM_REG_RNG_SAR_ENABLE_S)
#define LP_SYSTEM_REG_RNG_SAR_ENABLE_V  0x00000001U
#define LP_SYSTEM_REG_RNG_SAR_ENABLE_S  9
/** LP_SYSTEM_REG_RNG_SAR_DATA : RO; bitpos: [28:16]; default: 0;
 *  debug rng sar sample cnt
 */
#define LP_SYSTEM_REG_RNG_SAR_DATA    0x00001FFFU
#define LP_SYSTEM_REG_RNG_SAR_DATA_M  (LP_SYSTEM_REG_RNG_SAR_DATA_V << LP_SYSTEM_REG_RNG_SAR_DATA_S)
#define LP_SYSTEM_REG_RNG_SAR_DATA_V  0x00001FFFU
#define LP_SYSTEM_REG_RNG_SAR_DATA_S  16

#ifdef __cplusplus
}
#endif
